In [10]:
import pandas as pd 
import numpy as np

In [14]:
data = {
    'name':['ali','maryam','taha','ali','taha','maryam','taha'],
    'saler': [10,12,20,5,8,12,4],
    'amount':[100,250,130,350,230,533,273]
}

In [15]:
df  = pd.DataFrame(data)
df

     name  saler  amount
0     ali     10     100
1  maryam     12     250
2    taha     20     130
3     ali      5     350
4    taha      8     230
5  maryam     12     533
6    taha      4     273

In [ ]:
pd.pivot_table(
    df,
    values=["saler", "amount"],
    index=["name"],
    aggfunc={"amount": np.mean, "saler": np.sum},
)

C:\Users\Taha\AppData\Local\Temp\ipykernel_7608\640914799.py:1: FutureWarning: The provided callable <function mean at 0x000002D9C17316C0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  pd.pivot_table(df,values=['saler','amount'],index=['name'],
C:\Users\Taha\AppData\Local\Temp\ipykernel_7608\640914799.py:1: FutureWarning: The provided callable <function sum at 0x000002D9C17302C0> is currently using SeriesGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  pd.pivot_table(df,values=['saler','amount'],index=['name'],

        amount  saler
name
ali      225.0     15
maryam   391.5     24
taha     211.0     32